{"basics":{"name":"Boris Orekhov","label":"Scientist","image":"","email":"nevmenandr@gmail.com","phone":"(916) 526-09-51","url":"https://nevmenandr.github.io/","summary":"Texts & computers","location":{"address":"11 Pokrovsky Bulvar","postalCode":"109028","city":"Moscow","countryCode":"RU"},"profiles":[{"network":"Twitter","username":"nevmenandr","url":"https://twitter.com/nevmenandr"}]},"work":[{"name":"School of Linguistics, HSE University","position":"Associate Professor","url":"https://www.hse.ru/en/staff/borekhov/","startDate":"2013-03-01"},{"name":"Laboratory for Digital Research of Literature and Folklore, Institute of Russian Literature (Pushkin House) of the Russian Academy of Sciences","position":"Senior Research Fellow","url":"https://pushkinskijdom.ru/laboratoriya-tsifrovyh-issledovanij-literatury-i-folklora_/boris-valerevich-orehov/","startDate":"2022-03-01"},{"name":"Laboratory of Computer Philology, Bashkir State University","position":"Engineer","startDate":"2011-01-01","endDate":"2014-01-01"},{"name":"Department of Foreign Literature, Bashkir State Pedagogical University","position":"Senior Lecturer","startDate":"2006-01-01","endDate":"2011-01-01"}],"education":[{"institution":"Bashkir State University, Ufa, Russia","location":"Ufa, Russia","url":"https://bashedu.ru/","area":"Philology","studyType":"MA","startDate":"1999-09-01","endDate":"2005-06-30","courses":["History of Russian Literature"]}],"certificates":[{"name":"Запуск подкаста: от идеи до монетизации","date":"2023-12-04","issuer":"HSE University","url":"https://www.hse.ru/mirror/pubs/share/880462498.pdf","icon":"fa-solid fa-microphone"},{"name":"Введение в облачные технологии","date":"2020-01-31","issuer":"HSE University","url":"https://www.hse.ru/mirror/pubs/share/522311004.pdf","icon":"fa-solid fa-server"}],"publications":[{"name":"Башкирский стих XX века. Корпусное исследование","publisher":"Алетейя","releaseDate":"2019","url":"https://nevmenandr.github.io/portfolio/assets/pdf/bverse.pdf","summary":"Представлены результаты всестороннего количественного исследования башкирской системы версификации в XX веке. С использованием современных статистических инструментов подвергаются анализу все уровни организации стихотворного текста от фоники до лексики и грамматики, с особенным вниманием к метру и ритму. Количественные данные получены на корпусе текстов 103 башкирских поэтов общим объемом в 1.77 млн словоупотреблений. Анализ предварен подробным обзором науки о тюркском стихе, начиная с 1950-х годов. Утверждается, что основную роль в башкирском стихосложении XX века играют силлабические формы фольклорного происхождения узун-кюй и кыска-кюй, первая из которых специфична для поволжско-кыпчакского слогосчитающего стиха. Приводится подробное сопоставление башкирского стиха с киргизским. Книга завершается примерами поэтических текстов на башкирском языке, сгенерированных с использованием искусственных нейронных сетей."},{"name":"Национальный корпус русского языка 2.0: новые возможности и перспективы развития","publisher":"Вопросы языкознания","releaseDate":"2024","url":"https://journals.rcsi.science/0373-658X/article/view/261465","summary":"В статье подводятся итоги проекта фундаментальной реконструкции и модернизации платформы Национального корпуса русского языка, осуществленного в 2020–2023 гг. В фокусе статьи новые возможности, которые открываются для лингвистов и более широкой аудитории, в частности, улучшение репрезентативности имеющихся корпусов, создание новых корпусов, новая разметка, полученная с помощью применения нейросетевых моделей, новые интерфейсные решения. Более детально рассматриваются три ярких новых компонента: ресурсный — новый корпус «Социальные сети», поисковый — Панхронический корпус, объединяющий поиск по корпусам разных периодов, и аналитический — функциональный комплекс статистики и визуализации данных."},{"name":"Hacking stylometry with multiple voices: Imaginary writers can override authorial signal in Delta","publisher":"Digital Scholarship in the Humanities","releaseDate":"2023","url":"https://doi.org/10.1093/llc/fqad012","summary":"It is a basic assumption of stylometry that texts written by the same person show greater stylometric similarity even if published under multiple pennames. Statistical authorship attribution strongly relies on the ability of Burrows’s Delta and its variants to cluster one author together regardless of pseudonyms. At the same time, the very first computational discoveries by the founder of modern stylometry showed that a single author is capable of producing multiple voices (Burrows, 1987, Computation into Criticism: A Study of Jane Austen’s Novels and an Experiment in Method. Clarendon Press). We investigate two authors whose stylistically autonomous pennames seem to deceive Delta and override authorial signals: a Portuguese poet Fernando Pessoa and a French novelist Romain Gary. Pessoa managed to create at least three pennames (the author himself used the term ‘heteronym’) who exhibit all traits of individual human beings from the stylometric point of view. Gary’s alter ego Emile Ajar, who was an intentional literary mystification, also demonstrates traits of stylometric autonomy. At the same time, other pseudonyms used by Gary lack that autonomy completely. Our investigation shows that there appears to be a continuum between a purely formal use of a penname, which brings almost no distinction from the real name of an author, and a strong literary sub-personality such as those created by Pessoa."}],"skills":[{"name":"Языки программирования","icon":"fa-solid fa-code","keywords":["Python","Perl","PHP","R"]},{"name":"Typography","icon":"fa-solid fa-font","keywords":["LaTeX","font design"]}],"languages":[{"language":"Russian","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""}],"interests":[{"name":"Лингвистика и литературоведение","icon":"fa-solid fa-tag","keywords":["16.21.65 Лексикография","16.21.47 Лексикология. Терминоведение","17.00.00 Литература. Литературоведение. Устное народное творчество","16.31.61 Приложение языкознания к другим наукам","16.31.21 Автоматическая обработка текста. Автоматический перевод. Автоматическое распознавание речи"]},{"name":"Компьютерные науки","icon":"fa-solid fa-tag","keywords":["28.23.00 Искусственный интеллект"]}],"projects":[{"name":"Национальный корпус русского языка","summary":"Национальный корпус русского языка — представительная коллекция текстов на русском языке общим объемом более 2 млрд слов, оснащенная лингвистической разметкой и инструментами поиска.","highlights":["Газетный корпус","Поэтический корпус","Русская классика","Социальные сети"],"url":"https://ruscorpora.ru","startDate":"2012"},{"name":"Параллельный корпус переводов «Слова о полку Игореве»","summary":"Инструмент сопоставительного чтения более 200 переводов средневекового памятника на современный русский язык и другие языки.","highlights":["Разработка","Выравнивание","Исследования"],"url":"http://nevmenandr.net/slovo/","startDate":"2007"}]}